SkyHao723/sweeper_chassis/firmware/stm32-chassis/user/main.c
static int16_t IMU_GyroToRaw(float gyro_rad_s)
{
    float v = gyro_rad_s * IMU_GYRO_TO_RAW;

    if (v >  32767.0f) v =  32767.0f;
    if (v < -32768.0f) v = -32768.0f;
    return (int16_t)v;
}

/*======================= 轮速采样 + IMU =========================
 * 只做采样和上报。**定位不在这里**: 卡尔曼滤波在上位机 RK3588 上跑。
 *=================================================================*/
static void Odom_Tick(void)
{
    Wheel_Update();
    IMU_Tick();     /* 位翻转 I2C 读 IMU, 大约 1~3ms */
}

/*=========================== 状态回传 ==============================
 * 主遥测帧严格按协议 24 字节; 扩展诊断帧头是 0x7E, 见文件开头的说明。
 *=================================================================*/
static void Send_MainTelemetry(uart_port_t *p)
{
    uint8_t f[TEL_FRAME_SIZE];
    uint8_t i;
    uint8_t bcc = 0;
    int16_t vx_mm = (int16_t)(body_vx * 1000.0f);       /* 轮速正解出的车体速度 */
    int16_t vy_mm = 0;                                  /* 差速车没有横向速度 */
    int16_t wz_mrad = (int16_t)(body_wz * 1000.0f);

    f[0] = TEL_HEAD;
    f[1] = (target_vx == 0.0f && target_wz == 0.0f) ? 1 : 0;   /* Flag_Stop */
    PutI16(&f[2], vx_mm);
    PutI16(&f[4], vy_mm);
    PutI16(&f[6], wz_mrad);
    /* IMU 六轴原始值。
       ★ 必须是 ±2g / ±500dps 量程下的值 —— 上位机是按固定系数换算的
         (MD 5.1 节): 加速度 /1671.84 = m/s², 角速度 ×0.00026644 = rad/s。
         YbImu 本身是 ±16g / ±2000dps, 已经在 IMU_AccelToRaw/GyroToRaw 里换算了。
       读失败时保留上一次的值(不清零), 上位机看 flags 的 bit3 判断是否可信。 */
    PutI16(&f[8],  IMU_AccelToRaw(imu_accel_g[0]));   /* ax */
    PutI16(&f[10], IMU_AccelToRaw(imu_accel_g[1]));   /* ay */
    PutI16(&f[12], IMU_AccelToRaw(imu_accel_g[2]));   /* az */
    PutI16(&f[14], IMU_GyroToRaw(imu_gyro[0]));       /* gx */
    PutI16(&f[16], IMU_GyroToRaw(imu_gyro[1]));       /* gy */
    PutI16(&f[18], IMU_GyroToRaw(imu_gyro[2]));       /* gz */
    PutU16(&f[20], battery_mv);
    for (i = 0; i < TEL_FRAME_SIZE - 2; i++) bcc ^= f[i];
    f[TEL_FRAME_SIZE - 2] = bcc;
    f[TEL_FRAME_SIZE - 1] = TEL_TAIL;

    for (i = 0; i < TEL_FRAME_SIZE; i++) Port_SendByte(p, f[i]);
}

/* 扩展诊断帧 (0x7E, 32 字节) —— 本工程自定义, 厂商驱动不认识。
 *
 * 完整布局见文件开头。这里只说为什么需要它:
 * 主遥测帧(24B)是厂商协议定死的, 没有地方放驱动器的输出电流和故障码。
 * 而"某个轮子到底有没有劲"这件事, 不看这两个量就只能靠猜。
 *
 * 帧同步上的安全性 —— 厂商 ROS 节点的入帧条件是"上一字节是帧尾 0x7D(或 0x7F)、
 * 本字节是帧头 0x7B"。本帧永远夹在两个完整的 24 字节帧之间发出, 自己帧头是
 * 0x7E、帧尾是 0x7D, 所以厂商那边会把它整帧跳过, 紧接着的那个 0x7B 恰好满足
 * 入帧条件 —— 24 字节帧一帧都不会丢, 厂商侧不需要任何改动。
 *=================================================================*/
static void Send_DiagFrame(uart_port_t *p)
{
    static uint8_t seq;
    uint8_t f[DIAG_FRAME_SIZE];
    uint8_t i;
    uint8_t bcc = 0;
    uint8_t flags = 0;

    if (ever_linked)      flags |= 0x01;
    if (failsafe_latched) flags |= 0x02;
    if (imu_ok)           flags |= 0x04;    /* 加速度最近一次读取成功 */
    if (imu_gyro_ok)      flags |= 0x08;    /* 陀螺仪不是恒 0(不是又没接上) */

    f[0] = DIAG_HEAD;
    f[1] = flags;
    PutI16(&f[2],  (int16_t)(body_vx * 1000.0f));   /* 轮速正解出的车体速度 */
    PutI16(&f[4],  (int16_t)(body_wz * 1000.0f));
    PutI16(&f[6],  wheel_left_rpm);      /* 实际 */
    PutI16(&f[8],  wheel_right_rpm);
    PutI16(&f[10], target_left_rpm);     /* 目标 */
    PutI16(&f[12], target_right_rpm);
    PutI16(&f[14], m1_cur);              /* 1号驱动器 输出扭矩电流 A×100 */
    PutI16(&f[16], m2_cur);              /* 2号驱动器 */
    f[18] = m1_fault;                    /* 1号故障码, 见 FOC_FAULT_* */
    f[19] = m2_fault;
    f[20] = m1_mode;                     /* 1号当前模式 0x05 速度 / 0x06 位置 */
    f[21] = m2_mode;
    f[22] = can_error_count;
    f[23] = ports[PORT_MAIN].bad_count;
    f[24] = ports[PORT_MAIN].ok_count;
    f[25] = ports[PORT_MAIN].overflow;
    f[26] = relay_state;                 /* bit0 电机 bit1 水泵 */
    f[27] = imu_status;                  /* YBIMU_ST_* */
    f[28] = imu_found_addr;              /* 0 = 没扫到 */
    f[29] = seq++;                       /* 帧序号, 上位机据此发现丢帧 */
    /* f[30] = BCC, f[31] = 0x7D 下面填 */

    for (i = 0; i < DIAG_FRAME_SIZE - 2; i++) bcc ^= f[i];
    f[DIAG_FRAME_SIZE - 2] = bcc;
    f[DIAG_FRAME_SIZE - 1] = DIAG_TAIL;

    for (i = 0; i < DIAG_FRAME_SIZE; i++) Port_SendByte(p, f[i]);
}

/*============================== main ===============================*/
int main(void)
{
    Tick_Init();
    CAN1_Init();
    USART1_Init();          /* PA9/PA10 -> CH340 / RK3588, 唯一的上位机口 */
    Relay_Init();
    Delay_ms(200);

    target_vx = 0.0f;
    target_wz = 0.0f;
    /* 上电先刹住, 等上位机发命令 */
    CAN1_SendStop(MOTOR1_CAN_ID);
    CAN1_SendStop(MOTOR2_CAN_ID);

    last_can_ms = g_tick_ms;
    last_odom_ms = g_tick_ms;
    last_tel_ms = g_tick_ms;
    last_cmd_ms = g_tick_ms;

    while (1)
    {
        Port_ProcessCommands(&ports[PORT_MAIN]);
        CAN1_Poll();

        /* 看门狗: 上位机 800ms 不发命令就自动停车, 并断开继电器。
           只有一个上位机, 它的帧直接喂狗, 不需要仲裁。 */
        if ((failsafe_latched == 0) &&
            (ever_linked) &&
            ((g_tick_ms - last_cmd_ms) > LINK_TIMEOUT_MS))
        {
            target_vx = 0.0f;
            target_wz = 0.0f;
            failsafe_latched = 1;
#if RELAY_OFF_ON_LINK_LOSS
            Relay_Set(0);       /* 断线了顺便把电机/水泵继电器也断开 */
#endif
        }

        /* 轮速采样 + IMU */
        if ((g_tick_ms - last_odom_ms) >= ODOM_PERIOD_MS)
        {
            last_odom_ms = g_tick_ms;
            Odom_Tick();
        }

        /* 逆解 + CAN 下发 */
        if ((g_tick_ms - last_can_ms) >= CAN_PERIOD_MS)
        {
            last_can_ms = g_tick_ms;
            Drive_Apply();
        }

        /* 上报: 先标准 24 字节帧, 紧跟一帧扩展诊断帧。
           顺序不能反 —— 诊断帧必须夹在两个 24 字节帧之间, 厂商节点才能
           干净地跳过它并正确重新同步。 */
        if ((g_tick_ms - last_tel_ms) >= TELEMETRY_PERIOD_MS)
        {
            last_tel_ms = g_tick_ms;

            Send_MainTelemetry(&ports[PORT_MAIN]);
            Send_DiagFrame(&ports[PORT_MAIN]);
        }

        CAN1_Poll();
        Delay_ms(1);
    }
}
